Hash function h(i) = (2i + 5) mod 11
    Khóa    | Vị trí
-----------------------------
    12      | 7
    44      | 5
    13      | 9
    88      | 5 (c)
    23      | 7 (c)
    94      | 6
    11      | 5 (c)
    39      | 6 (c)
    20      | 1
    16      | 4
    5       | 4 (c)

 a) Bảng băm với Chaining
 Vị trí | Keys (Danh sách liên kết)
 --------------------------------
 0      |
 1      | 20
 2      |
 3      |
 4      | 16 → 5
 5      | 44 → 88 → 11
 6      | 94 → 39
 7      | 12 → 23
 8      |
 9      | 13
 10     |

 b) Bảng băm với Linear Probing
 vị trí| Key
 --------------
 0     | 11
 1     | 39
 2     | 20
 3     | 5
 4     | 16
 5     | 44
 6     | 88
 7     | 12
 8     | 23
 9     | 13
 10    | 94
